{"data":{"markdownRemark":{"html":"<p>The Hook Model is a guide into designing habits and increasing engagement that will benefit your users.</p>\n<p>Last year I was book deep into researching engagement strategies and came across the Hook Model framework. Nearly 18 months later I was able to put it into practice on an e-commerce project and saw massive growth in a short period of time by following the simple framework.</p>\n<h2>What is the Hook Model?</h2>\n<p>The Hook Model was created by Nir Eyal and was turned into a <a href=\"http://www.nirandfar.com/hooked\">brilliant book</a> that you absolutely must read.</p>\n<p>A habit is a behaviour done with little or no conscious thought so in short, the Hook Model details how to build habit forming products that will increase user engagement. </p>\n<p>Before we can begin creating a habit path, we need to look at how users are interacting with the site or app and the path of their visit. This is also something that needs to be closely monitored to see how users are behaving. If this is a brand new site or app, user testing is key, so shipping a prototype quickly will be the best method to get feedback. </p>\n<p>Frequency is key to forming habits so this framework may not work for every project.</p>\n<h2>How to build habit forming products</h2>\n<h3>The basic framework</h3>\n<p><strong>Hook model</strong></p>\n<ol>\n<li>Trigger</li>\n<li>Action</li>\n<li>Reward</li>\n<li>Investment</li>\n</ol>\n<h3>The Hook Model in detail</h3>\n<ol>\n<li>\n<p><strong>Trigger</strong>: How does the loop start? In the beginning this may be through an external trigger like an email or notification. Through repeated use the user will eventually create an internal trigger where a particular thought or emotion will bring them back.</p>\n</li>\n<li>\n<p><strong>Action</strong>: Once triggered the user will need to perform an action that is then rewarded. For example, adding a product to their wishlist or seeing getting rid of a notification.</p>\n</li>\n<li>\n<p><strong>Reward</strong>: How will users be rewarded? This could be social validation, collection of material resources or personal gratification. Variability is important, rewards shouldn't be predictable as we want users to continue the loop.</p>\n</li>\n<li>\n<p><strong>Investment</strong>: Lastly, the user needs to put something back in to increase the chance of repeating the loop. This could be in the form of user submitted content like profile information (like Facebook) or gain reputation (like Reddit).</p>\n</li>\n</ol>\n<h2>The Power of habit</h2>\n<p>Designing habit forming products is a form of manipulation so understanding the underlying psychology is important. A book that I would recommend reading is <a href=\"https://www.amazon.co.uk/Power-Habit-Why-What-Change/dp/1847946240\">The Power of Habit by Charles Duhgg</a> that details the psychology behind habit formation.</p>","timeToRead":2,"excerpt":"The Hook Model is a guide into designing habits and increasing engagement that will benefit your users. Last year I was book deep into…","frontmatter":{"title":"Hook Model","date":"01. May 2017","category":"User Experience"},"fields":{"slug":"/blog/hook-model","sourceInstanceName":"blog"}}},"pageContext":{"slug":"/blog/hook-model","left":{"frontmatter":{"category":"Accessibility","title":"An Open Letter To Web Designers"},"fields":{"slug":"/blog/an-open-letter-to-web-designers"}},"right":{"frontmatter":{"category":"User Experience","title":"Lean UX"},"fields":{"slug":"/blog/lean-ux"}}}}