{"data":{"allMarkdownRemark":{"totalCount":10,"edges":[{"node":{"fields":{"slug":"/blog/cognitive-walkthrough"},"excerpt":"What is a Cognitive Walkthrough? Cognitive Walkthroughs are used to examine the usability of a product and are usually carried out internally. Internal staff are asked to think like a user when evaluating the products UI. They will walkthrough user scenarios following the \"perfect path\" and check…","timeToRead":1,"frontmatter":{"title":"Cognitive Walkthrough","date":"01. April 2018","category":"User Experience"}}},{"node":{"fields":{"slug":"/blog/heuristic-evaluations"},"excerpt":"What is a Heuristic Evaluation? In a heuristic evaluation, a usability expert will review a website and compare it against accepted usability principles. This analysis will result in a list of potential usability issues. A heuristic evaluation is a usability inspection method and there are many…","timeToRead":2,"frontmatter":{"title":"Heuristic Evaluations","date":"11. March 2018","category":"User Experience"}}},{"node":{"fields":{"slug":"/blog/how-i-combine-quantitative-and-qualitative-data"},"excerpt":"Qualitative and quantitative are two essential approaches to understanding your users. Combining qualitative and quantitative data can improve an evaluation by ensuring that the limitations of one type of data are balanced by the strengths of another. This will ensure that understanding is improved…","timeToRead":2,"frontmatter":{"title":"How I Combine Quantitative and Qualitative Data","date":"29. September 2017","category":"User Experience"}}},{"node":{"fields":{"slug":"/blog/measuring-success-in-ux"},"excerpt":"User Experience seems to be leaning more heavily towards data science to gather the metrics that can be used to measure the success rate. \nSuccess is just one of the many metrics used for measuring/quantifying usability but is arguably the most useful for web applications. Below are a few indicators…","timeToRead":2,"frontmatter":{"title":"Measuring Success In UX","date":"30. July 2017","category":"User Experience"}}},{"node":{"fields":{"slug":"/blog/the-problem-with-password-ux"},"excerpt":"Forgotten Password UX is a pain point for the vast majority of us. The average person has a lot of passwords to try and remember. From websites to social media platforms to apps. The list of pretty huge for the average digital user. This survey  found that 61% of people reuse the same password on…","timeToRead":2,"frontmatter":{"title":"The Problem with Password UX","date":"24. June 2017","category":"User Experience"}}},{"node":{"fields":{"slug":"/blog/hook-model"},"excerpt":"The Hook Model is a guide into designing habits and increasing engagement that will benefit your users. Last year I was book deep into researching engagement strategies and came across the Hook Model framework. Nearly 18 months later I was able to put it into practice on an e-commerce project and…","timeToRead":2,"frontmatter":{"title":"Hook Model","date":"01. May 2017","category":"User Experience"}}},{"node":{"fields":{"slug":"/blog/forget-everything-you-know"},"excerpt":"Forgetting how you use websites is crucial to understanding how your users will use your website. You need to get back to basic thinking or as Richard Saul Wurman would say \"be dumb\". Richard Saul Wurman  is usually credited with the creation of  TED  but was also a pioneer of information…","timeToRead":1,"frontmatter":{"title":"Forget Everything You Know","date":"09. April 2017","category":"User Experience"}}},{"node":{"fields":{"slug":"/blog/lean-ux"},"excerpt":"The newest buzz word on the block is Lean UX. Lean UX is basically doing UX in the context of Agile development. It's a faster more iterative approach to web design. Where does research fit into a lean process? A great approach is  The The Design Sprint  which is a 5 day process that aims to speed…","timeToRead":1,"frontmatter":{"title":"Lean UX","date":"08. February 2017","category":"User Experience"}}},{"node":{"fields":{"slug":"/blog/how-to-ruin-an-experience"},"excerpt":"I've recently noticed that as a front end developer, i'm liking working with the web much more but as a user, I am constantly irritated by a lack of attention to detail and can see where users were not considered. Here is a list of some annoyances I have with todays web: Scroll Hijacking.  Never do…","timeToRead":2,"frontmatter":{"title":"How to Ruin An Experience","date":"06. January 2017","category":"User Experience"}}},{"node":{"fields":{"slug":"/blog/future-of-navigation"},"excerpt":"Navigation on the web sucks. Large websites can be hard to use and oftentimes send you to the wrong place. Most e-commerce websites I use are terrible at navigation. As it currently stands maintaining separate location tools, in this case a main navigation and search on websites usually means one…","timeToRead":1,"frontmatter":{"title":"Future of Navigation","date":"19. November 2016","category":"User Experience"}}}]}},"pageContext":{"jsonName":"categories-user-experience-94e","internalComponentName":"ComponentCategoriesUserExperience","path":"/categories/user-experience/","component":"/Users/emilyyoung/Documents/portfolio/src/templates/category.jsx","componentChunkName":"component---src-templates-category-jsx","context":{"category":"User Experience"},"updatedAt":1533496413494,"pluginCreator___NODE":"Plugin default-site-plugin","pluginCreatorId":"Plugin default-site-plugin","componentPath":"/Users/emilyyoung/Documents/portfolio/src/templates/category.jsx","category":"User Experience"}}