{"data":{"allMarkdownRemark":{"totalCount":8,"edges":[{"node":{"fields":{"slug":"/blog/aria-labelledby"},"excerpt":"The  aria-labelledby  attribute can be used to provide an accessible name to a subset of elements. It's used to associate a group of elements, or to establish a relationship between groups. It's function works similar to the alt and title attributes. Semantic markup is always preferred over ARIA…","timeToRead":1,"frontmatter":{"title":"ARIA labelledby","date":"02. June 2017","category":"Accessibility"}}},{"node":{"fields":{"slug":"/blog/when-to-use-buttons"},"excerpt":"When to use a button is often confusing for beginners and advanced HTML authors alike. The confusion is made worse by the many different types of buttons that you can use and personal preferences. Buttons : <button>Button</button> <button type=\"submit\">Submit button</button> Input Buttons : <input…","timeToRead":1,"frontmatter":{"title":"When To Use Buttons","date":"02. March 2017","category":"Accessibility"}}},{"node":{"fields":{"slug":"/blog/aria-landmark-roles"},"excerpt":"ARIA landmark roles help screen reader users understand the purpose of different areas of a web page, such as search, navigation or the main content. They are  really simple to add to your markup. Roles allow you to provide meaning and a relationship when HTML elements can't provide it. They give…","timeToRead":2,"frontmatter":{"title":"ARIA Landmark Roles","date":"11. September 2016","category":"Accessibility"}}},{"node":{"fields":{"slug":"/blog/how-i-audit-builds"},"excerpt":"Accessibility isn't just a technical issue. It's a design issue. It's a content issue. It's something that every department that touches a website should think about. Accessibility is about people . Not people with disabilities. I see an audit as a way to correct issues prior to a website going live…","timeToRead":2,"frontmatter":{"title":"How I audit builds","date":"22. July 2016","category":"Accessibility"}}},{"node":{"fields":{"slug":"/blog/an-open-letter-to-web-designers"},"excerpt":"Over the last year I’ve noticed something quite dreadful. My eyes are failing me. I forced myself to go for a check up and my fears were confirmed. I chose my glasses and accepted the fact that I will be relying on them more and more. Something else I have noticed pre-glasses was the state of…","timeToRead":2,"frontmatter":{"title":"An Open Letter To Web Designers","date":"21. March 2016","category":"Accessibility"}}},{"node":{"fields":{"slug":"/blog/document-outlines"},"excerpt":"Every Web page has a document outline and it is created by your headings, table titles, form titles etc. The document outline is the  structure  of your web page. A document outline is pretty much like a table of contents for your web page and is then used by assistive technologies and search…","timeToRead":2,"frontmatter":{"title":"Document Outlines","date":"06. January 2016","category":"Accessibility"}}},{"node":{"fields":{"slug":"/blog/apple-accessibility-settings"},"excerpt":"I have always been impressed with Apple's concern for accessibility but the latest iOS 8 is a massive improvement. Since Apple went flat in version 7 I have struggled with reading on the device and had to think a lot more about what I wanted to do (Caps lock anyone?) and where I needed to go. The…","timeToRead":1,"frontmatter":{"title":"Apple Accessibility Settings","date":"20. September 2015","category":"Accessibility"}}},{"node":{"fields":{"slug":"/blog/accessibility-quick-wins"},"excerpt":"Accessibility does't have to be hard, you shouldn't need to read reems of documentation or worry about the extra time it will take. I started to take an increasing interest in accessibility when I realised I was having to jump through hoops in order to use the internet. I primarily use a keyboard…","timeToRead":2,"frontmatter":{"title":"Accessibility Quick Wins","date":"08. May 2015","category":"Accessibility"}}}]}},"pageContext":{"jsonName":"categories-accessibility-311","internalComponentName":"ComponentCategoriesAccessibility","path":"/categories/accessibility/","component":"/Users/emilyyoung/Documents/portfolio/src/templates/category.jsx","componentChunkName":"component---src-templates-category-jsx","context":{"category":"Accessibility"},"updatedAt":1533496413495,"pluginCreator___NODE":"Plugin default-site-plugin","pluginCreatorId":"Plugin default-site-plugin","componentPath":"/Users/emilyyoung/Documents/portfolio/src/templates/category.jsx","category":"Accessibility"}}