{"data":{"markdownRemark":{"html":"<p>Qualitative and quantitative are two essential approaches to understanding your users. Combining qualitative and quantitative data can improve an evaluation by ensuring that the limitations of one type of data are balanced by the strengths of another. This will ensure that understanding is improved by integrating different ways of knowing. </p>\n<p>Quantitative — Looking at numbers. You would use this to get data on <em>how</em> people behave.</p>\n<p>Qualitative — Looking at intangible data. This is subjective information and you use this to try and understand <em>why</em> people behave a certain way.</p>\n<p>The aim is to increase the usefulness and validity of my findings so that I can create a hypotheses. The steps I usually follow are:</p>\n<h2>Step 1: Identify the biggest problems</h2>\n<h3>Interview current users</h3>\n<p>This can involve observing 4 - 6 users and asking questions at the end or simply creating a survey online and asking users specific questions during their experience.</p>\n<h2>Step 2: Understand what</h2>\n<h3>Study relevant metrics</h3>\n<p>Gathering metrics and analysing user behaviour by looking at the user flow, investigating interactions and checking for errors in the journey.</p>\n<h2>Step: 3 Propose solutions</h2>\n<h3>Create solution hypotheses</h3>\n<p>I compare the quant and qual data to look for patterns or contradictions. I then compile the findings to generate insights.</p>\n<p>Always cross check your results with different services to ensure you are getting similar results. </p>\n<h2>Useful Tools</h2>\n<p><a href=\"https://mixpanel.com/\">Mixpanel</a> - Powerful analytics using automated insights. Mixpanel does the heavy lifting and does the complex analysis for you.</p>\n<p><a href=\"https://qualaroo.com/\">Qualaroo</a> – A Survey Platform to help you learn why users carried out certain. You can survey desktop or mobile users and target questions during their experience.</p>\n<p><a href=\"https://www.google.com/analytics/surveys/#?modal_active=none\">Google Surveys</a> - Easy to use online surveys that give you a dashboard to analyses your survey data.</p>\n<p><a href=\"https://www.typeform.com/\">Typeform</a> – A fun  and interactive interactive way to ask and answer questions. This works best when integrated with google analytics.</p>\n<p><a href=\"https://www.google.com/analytics/\">Google Analytics</a> – Provides quantitative insights such as website traffic, traffic sources, conversions, device type etc.</p>\n<p><a href=\"http://www.crazyegg.com/\">Crazy Egg</a> – Shows you how users are behaving on your site: where they’re clicking, where they stop reading or watching, how different segments of traffic behave differently using heatmapping.</p>\n<p><a href=\"https://www.hotjar.com/\">HotJar</a> - An all in one solution. Heatmaps, Recordings, Surveys, Form analysis etc.</p>\n<p><a href=\"https://www.surveymonkey.co.uk/\">SurveyMonkey</a> – Can help you gather qualitative data from users in a variety of ways. You can then extract and share actionable insights.</p>\n<p><a href=\"https://www.optimizely.com/\">Optimizely</a> - A full service suite offering analytics, user testing, insights and more.</p>\n<h2>Summary</h2>\n<p>If you’re trying to create a hypotheses, using both qualitative and quantitative data can increase how useful and meaningful your findings are. You can also take advantage of the opportunities afforded by mixing the two methods. My 3 step process is ever evolving as the methods and tools I use are constantly changing and getting better but I know that my process will always combine both qualitative and quantitative data.</p>","timeToRead":2,"excerpt":"Qualitative and quantitative are two essential approaches to understanding your users. Combining qualitative and quantitative data can…","frontmatter":{"title":"How I Combine Quantitative and Qualitative Data","date":"29. September 2017","category":"User Experience"},"fields":{"slug":"/blog/how-i-combine-quantitative-and-qualitative-data","sourceInstanceName":"blog"}}},"pageContext":{"jsonName":"blog-how-i-combine-quantitative-and-qualitative-data-cba","internalComponentName":"ComponentBlogHowICombineQuantitativeAndQualitativeData","path":"/blog/how-i-combine-quantitative-and-qualitative-data","component":"/Users/emilyyoung/Documents/portfolio/src/templates/post.jsx","componentChunkName":"component---src-templates-post-jsx","context":{"slug":"/blog/how-i-combine-quantitative-and-qualitative-data","left":{"frontmatter":{"category":"Accessibility","title":"An Open Letter To Web Designers"},"fields":{"slug":"/blog/an-open-letter-to-web-designers"}},"right":{"frontmatter":{"category":"Accessibility","title":"ARIA Landmark Roles"},"fields":{"slug":"/blog/aria-landmark-roles"}}},"updatedAt":1533496413460,"pluginCreator___NODE":"Plugin default-site-plugin","pluginCreatorId":"Plugin default-site-plugin","componentPath":"/Users/emilyyoung/Documents/portfolio/src/templates/post.jsx","slug":"/blog/how-i-combine-quantitative-and-qualitative-data","left":{"frontmatter":{"category":"Accessibility","title":"An Open Letter To Web Designers"},"fields":{"slug":"/blog/an-open-letter-to-web-designers"}},"right":{"frontmatter":{"category":"Accessibility","title":"ARIA Landmark Roles"},"fields":{"slug":"/blog/aria-landmark-roles"}}}}