{"data":{"markdownRemark":{"html":"<p>User Experience seems to be leaning more heavily towards data science to gather the metrics that can be used to measure the success rate.\nSuccess is just one of the many metrics used for measuring/quantifying usability but is arguably the most useful for web applications.</p>\n<p>Below are a few indicators that can be used to simplify the UX process.</p>\n<h2>Errors</h2>\n<p>Documenting errors can confirm existing UI problems and lead to actionable results. Assign each error with a short description, a severity rating, and classify each error under a category.</p>\n<p>Recording this information and documenting each error or mistake can be time consuming but it does provide very useful diagnostic information. </p>\n<h3>Software that can record sessions:</h3>\n<ul>\n<li><a href=\"https://luckyorange.com/\">Lucky Orange</a></li>\n<li><a href=\"https://www.inspectlet.com/\">Inspectlet</a></li>\n<li><a href=\"https://www.hotjar.com/\">Hot Jar</a></li>\n</ul>\n<h2>System Usability Scale</h2>\n<p>The System Usability Scale (SUS) provides a way to measure usability. </p>\n<p>SUS is a ten item questionnaire that gathers subjective information. The questionnaire is easy to administer and is considered statistically valid. The scoring system can become quite complex and the end results don't give you any diagnostics.</p>\n<p>More information about SUS and how to calculate and interpret the data can be <a href=\"https://measuringu.com/sus/\">found here</a></p>\n<h2>Completion Rate</h2>\n<p>Completion rate is the best way to measure efficiency and productivity in your product. </p>\n<p>Create some clear criteria for your users and if they successfully complete the tasks, they are given a 1 and if they fail, they are given a 0.</p>\n<p>To calculate simply divide the successful tasks by the total number of tasks and multiply that by 100 and you will have your completion rate.</p>\n<p>A practical completion rate of 75% would be adequate in most situations.</p>\n<h3>Single Usability Metric (SUM)</h3>\n<p>On occasion there will be times where you may need to combine metrics into a single score, for example when you have comparisons.</p>\n<p>SUM is a standardised, summated and single usability metric and comprises completion rates, task-level satisfaction and task time.</p>\n<p>More information about SUM and how to calculate and interpret the data can be <a href=\"https://measuringu.com/sum-2/\">found here</a></p>\n<h2>Conversion</h2>\n<p>Conversion rates are a variation on the completion rate and are considered the essential metric in eCommerce.</p>\n<p>Conversion is calculated similar to the completion rate but will capture many parts of the sales process from the landing page, sign up, checkout and purchase.</p>\n<h2>Basket Abandonment</h2>\n<p>Basket abandonment is a big deal in UX as it can lead to lost revenue.</p>\n<p><a href=\"https://itworks.agency/average-retail-conversion-rates/\">The current average conversion rate for Q1 2017 is 2.53%</a></p>\n<p>Delving into the checkout process analytics and creating experiments to decrease this number is the main route.</p>\n<h3>Some experiments to try include:</h3>\n<ul>\n<li>Guest Checkout</li>\n<li>Remove Upsells</li>\n<li>Keep Basket Visible</li>\n<li>Offer free shipping</li>\n<li>Streamline the checkout process</li>\n<li>Include option to save the items for later</li>\n<li>Offer more payment options</li>\n</ul>\n<p>With each experiment, it is better to A/B test so you have a comparison measurement.</p>\n<h2>Conclusion</h2>\n<p>Try to avoid subjective and vanity measures and instead try to figure out how you'll quantify the value you’re creating for your users. Data can give you lots of numbers to understand but your users are the ones who can give you the why behind those numbers.</p>","timeToRead":2,"excerpt":"User Experience seems to be leaning more heavily towards data science to gather the metrics that can be used to measure the success rate…","frontmatter":{"title":"Measuring Success In UX","date":"30. July 2017","category":"User Experience"},"fields":{"slug":"/blog/measuring-success-in-ux","sourceInstanceName":"blog"}}},"pageContext":{"slug":"/blog/measuring-success-in-ux","left":{"frontmatter":{"category":"Accessibility","title":"ARIA Landmark Roles"},"fields":{"slug":"/blog/aria-landmark-roles"}},"right":{"frontmatter":{"category":"Accessibility","title":"Apple Accessibility Settings"},"fields":{"slug":"/blog/apple-accessibility-settings"}}}}