{"data":{"markdownRemark":{"html":"<p>I have been thinking a lot about how to manage my work load whilst staying focused recently and happened across Peter Drucker's excellent essay, <a href=\"http://hbr.org/2005/01/managing-oneself/\">Managing Oneself</a>.</p>\n<p>Whilst a lot of the advice didn't necessarily apply to me, some offered great insight into how best to perform.</p>\n<p>Managing Oneself is largely about figuring out your strengths and working in that direction. This is an interesting approach and one I have not come across before. Most methods around this subject tend to try and force you to change. Changing behaviour is extremely difficult so I found it surprising that Managing Oneself is unique in it's approach.</p>\n<h2>Feedback analysis</h2>\n<p>Feedback analysis is the key component to Managing Oneself and is how you discover what your strengths are.</p>\n<p>I applied this to my daily working life and found my strengths are always magnified when I am enjoying what I do. Take out the enjoyment and I soon lose interest and struggle.</p>\n<p>This of course isn't unusual but is a trait I wish I could change. That isn't what feedback analysis is about though. Playing to my strengths is what I need to concentrate on.</p>\n<h3>What are my strengths?</h3>\n<p>I’m excitable and optimistic. I reflect daily and I write blog posts that help me flesh out my bigger ideas. I use my introversion to aid me and turn my weaknesses into strengths. I'm good at organising and thinking about the future. I'm constantly improving.</p>\n<h3>How do I work?</h3>\n<p>I am a visual thinker and learner so I should use this more to my advantage. I learn through reading, writing, and trying things out. I’m more comfortable taking orders than giving. I need routine.</p>\n<p>I'm very organised and tend to have a big mapped out plan for what I want to do. This doesn't bode so well if I am paired with someone who prefers a more chaotic approach to their work. </p>\n<h3>What are my values?</h3>\n<p>I value people and their needs, no matter how different they are or how difficult it is for me. I struggle with people who settle for less due to this value.</p>\n<p>I value knowledge and learning. I like to pass on what I have learned.</p>\n<h3>Where do I belong?</h3>\n<p>I prefer small and don't do so well in high-stress, volatile or  workaholic environments. I do well with some additional time to work on useful side projects that will help everyone.</p>\n<h3>What should I contribute?</h3>\n<p>I struggled with this one as I don't think I can contribute much where I am at the moment. I recently joined a volunteer program to help me but this is all about my work.</p>\n<p>I think I could contribute more by learning more and applying this to my work.</p>\n<h3>Taking responsibility for relationships</h3>\n<p>I'm big on communication styles as everyone is different and everyone has their own way of thinking. I'm also very interested in mental health and psychology in general I am fascinated by people who are different or unique in their thinking. I should take the time to explore this more.</p>\n<h3>The second half of your life</h3>\n<p>I am not quite here yet! Though it is never too early to take up another interest, I have many already!</p>\n<p>It might be ten years or so before I need to be thinking about this question. Until that day, I am quite satisfied.</p>","timeToRead":2,"excerpt":"I have been thinking a lot about how to manage my work load whilst staying focused recently and happened across Peter Drucker's excellent…","frontmatter":{"title":"Managing Oneself","date":"12. July 2015","category":"Personal"},"fields":{"slug":"/blog/managing-oneself","sourceInstanceName":"blog"}}},"pageContext":{"slug":"/blog/managing-oneself","left":{"frontmatter":{"category":"User Experience","title":"Forget Everything You Know"},"fields":{"slug":"/blog/forget-everything-you-know"}},"right":{"frontmatter":{"category":"Accessibility","title":"An Open Letter To Web Designers"},"fields":{"slug":"/blog/an-open-letter-to-web-designers"}}}}