{"data":{"markdownRemark":{"html":"<p>I have always been impressed with Apple's concern for accessibility but the latest iOS 8 is a massive improvement.</p>\n<p>Since Apple went flat in version 7 I have struggled with reading on the device and had to think a lot more about what I wanted to do (Caps lock anyone?) and where I needed to go. The animations were a distraction and although they were cute and lovely, they offered me nothing.</p>\n<p>Luckily iBooks comes with its own unique settings so I was able to continue reading books no matter the overall design but getting around apps and using the device became bothersome.</p>\n<p>I opted for increasing text size, bolding text but I still struggled with contrast and no matter how high I set the brightness, the problem persisted. I started to look at other opertaing systems.</p>\n<p>The latest update has seen me playing with the contrast to the point I have found the exact solution that suits my needs. </p>\n<p>The vision settings are impressive and although I have no trouble with my hearing, these settings are a huge improvement also.</p>\n<p>Zoom is amazing for reading but reduce motion is my favourite. </p>\n<p>What makes me so happy about these settings is that many accessibility concerns have been addressed and the old myth that accessibility means blind people has been discarded.</p>\n<p>The only grumble I have is the fact that the accessibility menu is hidden under general and doesn't have its own prominent place. We can set a shortcut to a favourite feature though.</p>\n<p>Obviously a lot of testing went into this update and I would love Apple to produce their findings. This type of research doesn't happen often with designers so the information would be most valuable.</p>\n<p>Whilst everyone else is having a good moan about this OS and just a moan in general, I am most grateful for the little details that went into this update.</p>\n<p>I was at the point where I was looking around at other phone software to see if they met my needs. This update has saved me the time and the trouble. I feel like I have a brand new phone.</p>","timeToRead":1,"excerpt":"I have always been impressed with Apple's concern for accessibility but the latest iOS 8 is a massive improvement.Since Apple went flat in…","frontmatter":{"title":"Apple Accessibility Settings","date":"20. September 2015","category":"Accessibility"},"fields":{"slug":"/blog/apple-accessibility-settings","sourceInstanceName":"blog"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/blog/apple-accessibility-settings","left":{"frontmatter":{"category":"User Experience","title":"Measuring Success In UX"},"fields":{"slug":"/blog/measuring-success-in-ux"}},"right":{"frontmatter":{"category":"User Experience","title":"How to Ruin An Experience"},"fields":{"slug":"/blog/how-to-ruin-an-experience"}}}}