{"data":{"markdownRemark":{"html":"<p>ARIA landmark roles help screen reader users understand the purpose of different areas of a web page, such as search, navigation or the main content. They are  really simple to add to your markup.</p>\n<p>Roles allow you to provide meaning and a relationship when HTML elements can't provide it. They give meaning to semantic elements that have not been fully adopted by all browsers. An example of this would be Internet Explorer (IE) and the Main element, IE doesn't understand what the main element is.</p>\n<h2>Application Landmark</h2>\n<p><code>role=\"application\"</code></p>\n<p>The application landmark role is a region of the page that represents a unique software unit executing a set of tasks. It is strongly recommended that this role be used sparingly and with caution. </p>\n<h2>Banner Landmark</h2>\n<p><code>role=\"banner\"</code></p>\n<p>The landmark role banner is the main header or masthead of a page; usually assigned to the header element. The majority of content in a banner is site-oriented. It is unnecessary to have more than one banner role.</p>\n<h2>Complementary Landmark</h2>\n<p><code>role=\"complementary\"</code></p>\n<p>The complementary role is content that is relevant to the main content but can be considered separate from the main content. Similar in semantics to the aside element. </p>\n<h2>Contentinfo Landmark</h2>\n<p><code>role=\"contentinfo\"</code></p>\n<p>Contentinfo usually encompasses metadata, copyright information, links to privacy statements etc. This role is usually found on the footer element at the bottom of the document. It is unnecessary to have more than one contentinfo role.</p>\n<h2>Form Landmark</h2>\n<p><code>role=\"form\"</code></p>\n<p>The form landmark role is a region of the document that represents a collection of form elements. It is often advised for use on a semantically neutral element such as a div.</p>\n<h2>Main Landmark</h2>\n<p><code>role=\"main\"</code></p>\n<p>The main landmark role is the main content or topic of a document. It is unnecessary to have more than one main role.</p>\n<h2>Navigation Landmark</h2>\n<p><code>role=\"navigation\"</code></p>\n<p>The navigation landmark role is a collection of links for navigation and is usually found on a nav element.</p>\n<h2>Search Landmark</h2>\n<p><code>role=\"search\"</code></p>\n<p>The search landmark role is a search element containing your site’s search interface.</p>\n<h2>Some quick takeaways about landmark roles</h2>\n<ul>\n<li>Aria is useful but overuse, and incorrect use, will make it useless</li>\n<li>role=\"link\" used on anchors with a landmark role=\"navigation\" as a parent is a wasted effort</li>\n<li>Don't use more then one role=\"main\"</li>\n<li>Don't use a navigation role with only one link or clickable element</li>\n<li>Well crafted semantic HTML should always be your starting point</li>\n<li>A good authoring practice would be to apply landmarks to parent elements and make sure none of your content is orphaned. This will make navigating using a screen reader much easier.</li>\n</ul>","timeToRead":2,"excerpt":"ARIA landmark roles help screen reader users understand the purpose of different areas of a web page, such as search, navigation or the main…","frontmatter":{"title":"ARIA Landmark Roles","date":"11. September 2016","category":"Accessibility"},"fields":{"slug":"/blog/aria-landmark-roles","sourceInstanceName":"blog"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/blog/aria-landmark-roles","left":{"frontmatter":{"category":"Personal","title":"Managing Oneself"},"fields":{"slug":"/blog/managing-oneself"}},"right":{"frontmatter":{"category":"Accessibility","title":"Document Outlines"},"fields":{"slug":"/blog/document-outlines"}}}}